mjohansson/SolderingStation/fw/f103c8_fpdev/f103c8_fpdev.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F1
NVIC.USART3_IRQn=true\:0\:0\:false\:false\:true\:true\:true
ProjectManager.MainLocation=Src
RCC.MCOFreq_Value=72000000
PCC.Series=STM32F1
PB13.GPIOParameters=GPIO_Label
SH.S_TIM4_CH2.ConfNb=1
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F103C8Tx
SPI1.VirtualType=VM_MASTER
PB10.Mode=Asynchronous
PCC.Seq0.Step0.CPU_Frequency=48 MHz
PA10.GPIO_PuPd=GPIO_PULLUP
PCC.Seq0.Step0.User's_Consumption=0 mA
RCC.PLLCLKFreq_Value=72000000
PC13-TAMPER-RTC.GPIOParameters=GPIO_Label
PB14.GPIO_Label=FP_BTN_2Bn
TIM4.EncoderMode=TIM_ENCODERMODE_TI1
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-true,3-MX_USART1_UART_Init-USART1-false-HAL-true,4-MX_SPI1_Init-SPI1-false-HAL-true,5-MX_ADC1_Init-ADC1-false-HAL-true,6-MX_TIM3_Init-TIM3-false-HAL-true,7-MX_I2C1_Init-I2C1-false-HAL-true,8-MX_TIM1_Init-TIM1-false-HAL-true,9-MX_TIM2_Init-TIM2-false-HAL-true,10-MX_TIM4_Init-TIM4-false-HAL-true,11-MX_USART3_UART_Init-USART3-false-HAL-true
PA11.Mode=Device
PA3.GPIOParameters=GPIO_Label
RCC.ADCFreqValue=12000000
PA6.GPIO_Label=ADC1_IN6_HWID_MB
USART1.IPParameters=VirtualMode
PB13.GPIO_Label=FP_BTN_2An
PB11.Signal=USART3_RX
PB13.Signal=GPIO_Input
PB15.Signal=GPIO_Input
PA2.GPIOParameters=GPIO_Label
PinOutPanel.RotationAngle=0
TIM3.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
PD1-OSC_OUT.Signal=RCC_OSC_OUT
Mcu.IP4=SPI1
RCC.FCLKCortexFreq_Value=72000000
Mcu.IP5=SYS
I2C1.IPParameters=I2C_Mode
Mcu.IP2=NVIC
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP3=RCC
PA15.GPIO_Label=FLASH_CSn
Mcu.IP0=ADC1
PA12.Locked=true
Mcu.IP1=I2C1
PA12.Signal=USB_DP
PCC.PartNumber=STM32F103C8Tx
Mcu.UserConstants=USBD_AUDIO_FREQ,8000;USBD_CUSTOMHID_OUTREPORT_BUF_SIZE,2;USBD_CUSTOM_HID_REPORT_DESC_SIZE,1;USBD_DFU_XFER_SIZE,1;USBD_DFU_MAX_ITF_NUM,1;USBD_DFU_APP_DEFAULT_ADD,0x0800c000;MSC_MEDIA_PACKET,1
Mcu.ThirdPartyNb=0
SPI1.Direction=SPI_DIRECTION_2LINES
RCC.HCLKFreq_Value=72000000
Mcu.IPNb=13
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=72000000
PB6.Signal=S_TIM4_CH1
SPI1.CalculateBaudRate=18.0 MBits/s
PA8.GPIOParameters=GPIO_Label
Mcu.Pin6=PA2
Mcu.Pin7=PA3
Mcu.Pin8=PA4
Mcu.Pin9=PA5
RCC.AHBFreq_Value=72000000
PB13.Locked=true
Mcu.Pin0=PC13-TAMPER-RTC
Mcu.Pin1=PC14-OSC32_IN
Mcu.Pin2=PD0-OSC_IN
Mcu.Pin3=PD1-OSC_OUT
Mcu.Pin4=PA0-WKUP
Mcu.Pin5=PA1
ProjectManager.ProjectBuild=false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB3.Mode=Full_Duplex_Master
PA8.Locked=true
PA4.Locked=true
PCC.Seq0.Step0.Voltage_Source=Battery
Mcu.IP10=USART1
PCC.Seq0.Step0.DMIPS=0.0
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Mcu.IP12=USB
RCC.PLLMUL=RCC_PLL_MUL9
Mcu.IP11=USART3
PB12.GPIO_Label=SYS_RSTn
ProjectManager.FirmwarePackage=STM32Cube FW_F1 V1.8.3
MxDb.Version=DB.6.0.10
PB4.Mode=Full_Duplex_Master
ProjectManager.BackupPrevious=false
PA14.Mode=Serial_Wire
PB5.Mode=Full_Duplex_Master
File.Version=6
SH.S_TIM4_CH2.0=TIM4_CH2,Encoder_Interface
PB7.Signal=S_TIM4_CH2
PA8.Signal=GPIO_Output
PB8.Locked=true
PB6.Locked=true
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
SH.ADCx_IN6.ConfNb=1
ProjectManager.HalAssertFull=false
PB0.Locked=true
VP_TIM1_VS_ClockSourceINT.Mode=Internal
ProjectManager.ProjectName=f103c8_fpdev
RCC.PLLMCOFreq_Value=36000000
PCC.Seq0.Step0.Oscillator=HSE PLL
Mcu.Package=LQFP48
PB9.Signal=I2C1_SDA
PB1.Signal=S_TIM3_CH4
PA6.Signal=ADCx_IN6
PA7.Locked=true
PA5.Locked=true
ProjectManager.ToolChainLocation=
PA2.GPIO_Label=AUX_INTn
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
USART3.IPParameters=VirtualMode
PA10.Signal=USART1_RX
PA15.Signal=GPIO_Output
PCC.Checker=false
PA5.GPIOParameters=GPIO_Label
PB14.GPIOParameters=GPIO_Label
PCC.Seq0.Step0.Duration=1 ms
SH.S_TIM4_CH1.0=TIM4_CH1,Encoder_Interface
RCC.APB1TimFreq_Value=72000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PCC.Seq0.Step0.Peripherals=ADC1 APB1-Bridge APB2-Bridge BusMatrix DMA1 GPIOA GPIOB GPIOC PWR SPI1 SPI2 TIM3 USART1
NVIC.USART1_IRQn=true\:0\:0\:false\:false\:false\:true\:true
SPI1.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_4
PA4.GPIO_Label=FP_BTN_1Bn
ProjectManager.CustomerFirmwarePackage=
VP_TIM3_VS_ClockSourceINT.Mode=Internal
PC14-OSC32_IN.Locked=true
PB15.Locked=true
PB3.Locked=true
PB4.Signal=SPI1_MISO
PA3.Signal=GPIO_Input
PA2.Locked=true
PA6.GPIOParameters=GPIO_Label
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
RCC.VDD_VALUE=3
PCC.Seq0.Step0.Category=In DS Table
SH.S_TIM4_CH1.ConfNb=1
ProjectManager.ProjectFileName=f103c8_fpdev.ioc
PD1-OSC_OUT.Mode=HSE-External-Oscillator
PA10.Mode=Asynchronous
PA15.GPIOParameters=GPIO_Label
Mcu.PinsNb=39
PCC.Seq0.Step0.Average_Current=25 mA
PCC.Vdd=3.3
ProjectManager.NoMain=false
SPI1.IPParameters=VirtualType,Mode,Direction,BaudRatePrescaler,CalculateBaudRate
SH.ADCx_IN6.0=ADC1_IN6,IN6
ADC1.IPParameters=Rank-1\#ChannelRegularConversion,Channel-1\#ChannelRegularConversion,SamplingTime-1\#ChannelRegularConversion,NbrOfConversionFlag,master
PC13-TAMPER-RTC.Signal=GPIO_Output
ProjectManager.DefaultFWLocation=true
PD0-OSC_IN.Signal=RCC_OSC_IN
PB12.Locked=true
ProjectManager.DeletePrevious=true
PCC.Line=STM32F103
PB14.Locked=true
RCC.APB1CLKDivider=RCC_HCLK_DIV2
PB10.Locked=true
PC14-OSC32_IN.Signal=RCC_OSC32_IN
SH.S_TIM3_CH3.0=TIM3_CH3,PWM Generation3 CH3
SH.S_TIM2_CH1_ETR.ConfNb=1
RCC.FamilyName=M
PA0-WKUP.Signal=S_TIM2_CH1_ETR
RCC.ADCPresc=RCC_ADCPCLK2_DIV6
PA13.Signal=SYS_JTMS-SWDIO
TIM3.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
PCC.Seq0.Step0.TaMax=100.46
SH.S_TIM2_CH2.0=TIM2_CH2,TriggerSource_TI2FP2
PCC.MCU=STM32F103C(8-B)Tx
PA15.Locked=true
PA11.Locked=true
PA9.Mode=Asynchronous
PA8.GPIO_Label=DISP_CSn
PB11.Mode=Asynchronous
ProjectManager.TargetToolchain=Makefile
TIM4.IPParameters=EncoderMode,IC1Prescaler,IC2Prescaler
SH.S_TIM3_CH3.ConfNb=1
I2C1.I2C_Mode=I2C_Fast
PCC.Seq0.Step0.Mode=RUN
PB9.Mode=I2C
PA9.Signal=USART1_TX
SH.S_TIM2_CH2.ConfNb=1
VP_TIM1_VS_ClockSourceINT.Signal=TIM1_VS_ClockSourceINT
ADC1.Channel-1\#ChannelRegularConversion=ADC_CHANNEL_5
PB5.Locked=true
PB9.Locked=true
TIM4.IC2Prescaler=TIM_ICPSC_DIV2
ProjectManager.RegisterCallBack=
PC13-TAMPER-RTC.Locked=true
RCC.USBFreq_Value=72000000
VP_TIM3_VS_ClockSourceINT.Signal=TIM3_VS_ClockSourceINT
PA1.Signal=S_TIM2_CH2
PB1.Locked=true
PD0-OSC_IN.Mode=HSE-External-Oscillator
PB10.Signal=USART3_TX
PB14.Signal=GPIO_Input
PA5.Signal=ADCx_IN5
board=cube_setup
PCC.Temperature=25
ProjectManager.LastFirmware=true
PC13-TAMPER-RTC.GPIO_Label=BRD_LED_AUX_BOOT0
RCC.VCOOutput2Freq_Value=8000000
RCC.APB2Freq_Value=72000000
PCC.Seq0.Step0.Frequency=8 MHz
PCC.Seq0.Step0.Vcore=No Scale
MxCube.Version=6.1.0
Mcu.Pin37=VP_TIM2_VS_ControllerModeGated
Mcu.Pin38=VP_TIM3_VS_ClockSourceINT
PB15.GPIO_Label=FP_ENC_SWn
Mcu.Pin35=VP_SYS_VS_Systick
Mcu.Pin36=VP_TIM1_VS_ClockSourceINT
SPI1.Mode=SPI_MODE_MASTER
Mcu.Pin30=PB5
PA10.GPIOParameters=GPIO_PuPd
VP_SYS_VS_Systick.Mode=SysTick
Mcu.Pin33=PB8
TIM3.IPParameters=Channel-PWM Generation4 CH4,Channel-PWM Generation3 CH3
Mcu.Pin34=PB9
Mcu.Pin31=PB6
Mcu.Pin32=PB7
PA9.Locked=true
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.GPIOParameters=GPIO_Label
PB15.GPIOParameters=GPIO_Label
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
RCC.IPParameters=ADCFreqValue,ADCPresc,AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,MCOFreq_Value,PLLCLKFreq_Value,PLLMCOFreq_Value,PLLMUL,PLLSourceVirtual,SYSCLKFreq_VALUE,SYSCLKSource,TimSysFreq_Value,USBFreq_Value,VCOOutput2Freq_Value,VDD_VALUE
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F103C(8-B)Tx
Mcu.Pin26=PA14
Mcu.Pin27=PA15
PA2.Signal=GPIO_Input
Mcu.Pin24=PA12
ProjectManager.UnderRoot=false
Mcu.Pin25=PA13
Mcu.IP8=TIM3
Mcu.IP9=TIM4
Mcu.Pin28=PB3
Mcu.IP6=TIM1
Mcu.Pin29=PB4
Mcu.IP7=TIM2
ProjectManager.CoupleFile=true
PB4.Locked=true
PCC.Seq0.Step0.Memory=FLASH
PB3.Signal=SPI1_SCK
PA4.Signal=GPIO_Input
ADC1.SamplingTime-1\#ChannelRegularConversion=ADC_SAMPLETIME_1CYCLE_5
RCC.SYSCLKFreq_VALUE=72000000
PB5.Signal=SPI1_MOSI
Mcu.Pin22=PA10
Mcu.Pin23=PA11
RCC.TimSysFreq_Value=72000000
PA1.Locked=true
PA7.GPIO_Label=DISP_DCn
Mcu.Pin20=PA8
ADC1.master=1
PA3.Locked=true
Mcu.Pin21=PA9
PA12.Mode=Device
PA5.GPIO_Label=ADC1_IN5_HWID_FP
PA10.Locked=true
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=true
USART3.VirtualMode=VM_ASYNC
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
USART1.VirtualMode=VM_ASYNC
ProjectManager.CompilerOptimize=2
ADC1.Rank-1\#ChannelRegularConversion=1
PA11.Signal=USB_DM
SH.S_TIM2_CH1_ETR.0=TIM2_ETR,ClockSourceETR_Mode2
PA14.Signal=SYS_JTCK-SWCLK
ProjectManager.HeapSize=0x200
Mcu.Pin15=PB11
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PB12
Mcu.Pin13=PB1
Mcu.Pin14=PB10
Mcu.Pin19=PB15
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PB13
Mcu.Pin18=PB14
SH.ADCx_IN5.0=ADC1_IN5,IN5
SH.S_TIM3_CH4.ConfNb=1
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
ADC1.NbrOfConversionFlag=1
Mcu.Pin11=PA7
Mcu.Pin12=PB0
PB8.Mode=I2C
Mcu.Pin10=PA6
PB7.Locked=true
PB8.Signal=I2C1_SCL
SH.ADCx_IN5.ConfNb=1
PCC.Seq0.Step0.Vdd=3.3
PCC.Seq0=1
VP_TIM2_VS_ControllerModeGated.Mode=Gated Mode
RCC.APB1Freq_Value=36000000
PB0.Signal=S_TIM3_CH3
VP_TIM2_VS_ControllerModeGated.Signal=TIM2_VS_ControllerModeGated
PA7.GPIOParameters=GPIO_Label
PB11.Locked=true
ProjectManager.DeviceId=STM32F103C8Tx
PB12.GPIOParameters=GPIO_Label
PB12.Signal=GPIO_Output
ProjectManager.LibraryCopy=1
PA3.GPIO_Label=FP_BTN_1An
SH.S_TIM3_CH4.0=TIM3_CH4,PWM Generation4 CH4
PA7.Signal=GPIO_Output
PA6.Locked=true
TIM4.IC1Prescaler=TIM_ICPSC_DIV2
